/*
* @Author: NiceMing
* @Date:   2018-03-02 18:36:05
*/
var list = [
		// {
		// 	"id": 1,
		// 	"title": "校区经营核心诊断评估",
		// 	"state":0,
		// 	"stateName": "未发布",
		// 	"time": "2018-07-01",
		// 	"questions": [
		// 		{
		// 			"type": "radio",
		// 			"topic": "校区营销人力情况",
		// 			"options": [{name:"1-3人",value:5},{name:"4-5人",value:15},{name:"6-7人",value:20},{name:"8-10人",value:15},{name:"11人以上",value:10},{name:"0人",value:0}]			
		// 		},

		// 		{
		// 			"type": "radio",
		// 			"topic": "校区营销人力情况",
		// 			"options": [{name:"1-3人",value:5},{name:"4-5人",value:15},{name:"6-7人",value:20},{name:"8-10人",value:15},{name:"11人以上",value:10},{name:"0人",value:0}]			
		// 		},

		// 		{
		// 			"type": "radio",
		// 			"topic": "校区营销人力情况",
		// 			"options": [{name:"1-3人",value:5},{name:"4-5人",value:15},{name:"6-7人",value:20},{name:"8-10人",value:15},{name:"11人以上",value:10},{name:"0人",value:0}]			
		// 		}

		// 	]
		// },
		{
			"id": 1,
			"title": "投资人考评体系",
			"state": 0,
			"stateName": "未发布",
			"time": "2019-09-30",
			"questions": [
				{
					"type": "switch",
					"topic": "人力考评",
					"group":"a",
					"options": ["每周是否花半天以上招聘校区核心员工","员工是否全职化","员工团队是否按总部标准配备整齐","每周是否发送招聘信息","每月是否监督张贴招聘海报"]
				},
				{
					"type": "switch",
					"topic": "思想意识",
					"group":"b",
					"options": ["是否遵循营销先行的理念（新签第一、新签团队配备第一）","是否不断要求员工在工作中对总部业务指导的服从，真正做到让校长和员工听话照做"]
				},
				{
					"type": "switch",
					"topic": "风控意识",
					"group":"c",
					"options": ["是否每天早中晚各抽15-20分钟进行校区群痕迹化和工作活跃度检查","是否校区群每天检查校长、各主任等每天工作安排；周工作安排和周总结","是否每天在校区群检查咨询师日报、市场专员日报、校长日报、学管日报，偶尔点评点赞","是否每周每月监督校长对校区业绩目标达成","每周抽查一次学员资料录入御学云系统的情况","每月抽查课时单情况"]
				}
				,
		
				{
					"type": "switch",
					"topic": "员工激励",
					"group":"d",
					"options": ["审批校长提交的全员月度转介绍激励计划","审批校长提交的学管部续费业绩挑战激励计划，真正做到让校长和员工听话照做","审批校长提交的市场部业绩挑战激励计划","审批校长提交的咨询部业绩挑战激励计划"]
				}
				,

				{
					"type": "switch",
					"topic": "工作监督",
					"group":"e",
					"options": ["每周过问校区周例会是否正常召开，是否会议图片入群","每周过问晨会或夕会是否召开，拍照入群","每周周五资源梳理会是否召开，拍照入群","检查校长和部门负责人是否每周参与总部会议，并将会议内容布置入校区群"]
				}
				,
				
				
				
				{
					"type": "switch",
					"topic": "总部联络",
					"group":"f",
					"options": ["没月是否主动与总部总经理和线路负责人工作联系2-4次"]
				}
				,
						
				{
					"type": "switch",
					"topic": "工作交流",
					"group":"g",
					"options": ["	每周花20分钟听校长工作汇报","每周花2小时听咨询主任、市场专员、学管主任、教研主任汇报工作并谈心","每周花20分钟抽查ATP全域教研痕迹和档案内容","每周花20分钟抽查学管部服务及学员档案内容"]
				}
				,
						
				{
					"type": "switch",
					"topic": "培训管理",
					"group":"k",
					"options": ["	每周是否抽查晨会夕会校区内部培训学习情况","每周是否抽查员工师训吾优学习情况","每周是否抽查晨会夕会校区内部培训学习情况"]
				}
				,
						
				{
					"type": "switch",
					"topic": "管理小细节",
					"group":"l",
					"options": ["	每周是否抽查性参加校区管理会或晨夕会或教研会等会议","是否每月开展校区团建活动、动员活动","是否在校区群和公司群为员工点赞或点评","是否经常活跃校区群，发送正能量内容和小红包"]
				}
				,	
				{
					"type": "switch",
					"topic": "坚持",
					"group":"o",
					"options": ["	总部要求的相关事项是否积极主动完成","是否每月开展校区团建活动、动员活动","以上每一项事务是否都坚持按规律做了"]
				}
				
			]
		},



		{
			"id": 2,
			"title": "市场专员考评体系",
			"state": 0,
			"stateName": "未发布",
			"time": "2019-09-30",
			"questions": [
				{
					"type": "gap",
					"topic": "填空题",
					"group":"a",
					
					"options": [{before:"我每周拉访上门客户标准数量是",after:"组，我每周都坚持做了。"},{before:"我每周有效电话资源收集数量是",after:"个，我每周都坚持做了。"},]
				},

				{
					"type": "switch",
					"topic": "是否题",
					"group":"b",
					"options": ["我每天都坚持地推了","我每天都会将工作内容和工作图片发送到校区群和总部市场群。"		,"我每天都会发送市场日报，我希望大家对我的工作监督，这样我的业绩会更好、成长更快。","我每周和校长一起组织全员营销3次以上并完成有效电话资源收集任务。"
					,"我校区周边2公里范围内我每月进行了4-7次广告覆盖","高峰期我会组织兼职市场专员进行市场活动并在每次活动前有动员会议分配任务，结束后总结","我进校关系维护每月4次以上","我每月开展了一次以上异业合作"
				,"我每月开展了一次社区活动","我每月更新并派发了一份新宣传单","我每月更新并张贴了一份新海报，累计没有低于15份"]
				}

		
			]
		},


		{
			"id": 3,
			"title": "校长考评体系",
			"state": 0,
			"stateName": "未发布",
			"time": "2019-09-30",
			"questions": [
		
				{
					"type": "switch",
					"topic": "校区群活跃",
					"group":"a",
					"options": [	"每天在校区群发送工作安排",
					"每天监督员工在校区群活跃，督促主任发日工作安排和状态",
					"每天安排员工发送晨夕会会议场景、培训场景",
					"每天发送员工激励、点赞内容",
					"每天点评咨询日报、市场日报、其它部门日报",
					"每周发送周工作安排和周工作总结"]
				},	{
					"type": "switch",
					"topic": "人力招聘",
					"group":"b",
					"options": ["每周坚持安排全员发送招聘H5",
					"每月安排人力招聘海报张贴，并保证校内张贴"]
				},	{
					"type": "switch",
					"topic": "思想意识",
					"group":"c",
					"options": ["我时刻注意工作重心营销先行（新签、续费、转介绍每周通报）（新签决定续费和转介绍）",
					"我将团队组建和招聘培养咨询师及市场专员优先、缺人就会没有业绩",
					"我深刻认识到投入和产出成正比，每月广告投放、物料制作是新签之魂",
					"我知道全员营销每周贵在坚持，不少于三次，我在亲自抓",
					"我知道评价校长的标准核心指标是业绩，没有业绩就没有我的校长岗位",
					"我知道我天天必须参与咨询工作和指导，没有新签源头将没有活水，学校业绩会枯竭，校长不合格",
					"我认识到校区群活跃是考核校长的根本要求，群管理能力就是校长管理团队的能力，群内员工每天工作痕迹化可视化，能让投资人放心校长和团队、才能极大降低投资人投资风险。",
					"我认识到我不可能所有事务比总部专家更专业，所以，我带领全体员工按照总部要求“听话照做”，总部专家团队指导才能让校区团队更专业，业绩更高"]
				},{
					"type": "switch",
					"topic": "市场管理",
					"group":"d",
					"options": [	"每天点评市场日报，并监督市场日报入群",
					"每天关注市场专员工作状况和数据，督促入群",
					"每周与市场专员分析周工作计划和周工作总结",
					"和市场专员一起带领全员每周参与营销3次以上"]
				},{
					"type": "switch",
					"topic": "咨询管理",
					"group":"e",
					"options": [	"每天参与咨询部晨夕会，理清资源、强化目标、找到方法、鼓舞士气，并发送会议场景入群",
					"每天在校区群阅读咨询日报并点评",
					"每天重点关注外呼量是否达成",
					"每天重点关注微信营销抽查到位",
					"每天关注咨询部对运维手册、咨询道具学习"]
				},{
					"type": "switch",
					"topic": "营销和管理专项",
					"group":"f",
					"options": [	"每月校区营销方案制定并向总部汇报、讨论、确认、执行",
					"月度广告投放方案、物料制作方案执行",
					"组织开展一次月度本校区个性化诊断"]
				},{
					"type": "switch",
					"topic": "方案制定",
					"group":"g",
					"options": ["月度市场业绩挑战激励制定并公布",
					"月度咨询业绩挑战激励制定并公布","月度转介绍业绩激励制度制定并公布","月度续费业绩挑战激励制定并公布"]
				},{
					"type": "switch",
					"topic": "周度工作",
					"group":"h",
					"options": ["总部周会议每次参",
					"周工作计划和总结发送总部和校区群通报",
					"督促市场专员每周向总部和校长本人提交周汇报总结并听取和分析",
					"督促咨询主任每周向总部和校长本人提交周汇报总结并听取和分析（含资源梳理表）并抽查咨询师的资源及微信营销推广",
					"督促学管主任每周向总部和校长本人提交周汇报总结并听取和分析（含资源梳理表）并抽查微信服务和档案记录及御学云录入",
					"督促教学主任每周向总部和校长本人提交周教学汇报和总结并抽查微信服务、教案等相关可视化资料"]
				},{
					"type": "switch",
					"topic": "会议管理",
					"group":"i",
					"options": ["校区综合会议组织",
					"保证各部门及本人积极参与总部周会和其它相关会议，并检查听会人员将会议精神在校区群传达点赞",
					"保证校区各部门周会和晨夕会正常有效召开，每周坚持抽查性参会（咨询晨夕会、资源梳理会、学管周会、教研周会等）"]
				},
				{
					"type": "switch",
					"topic": "培训管理",
					"group":"j",
					"options": ["保证任何时候新员工入职培训送总部",
					"总部所有培训鼓励员工参加并将学习心得发送到校区群，有条件组织员工受训结束后将受训内容与其他员工分享",
					"校长确保全体员工参与师训吾优每天持续学习，每周公布本校区学习情况并截图入群"]
				},
				{
					"type": "switch",
					"topic": "汇报",
					"group":"k",
					"options": ["每周坚持向投资人汇报周工作和业绩进展，取得投资人对工作的支持和协助。",
					"向总部及时准确提交月度工作总结和计划，共同制定任务目标，与总部一起确认月度工作方案",
					"遇到困难问题及时主动与总部各部门负责人沟通交流学习，不拖拉是好习惯、积极主动是好态度，借力打力才有好效果"]
				}
			



			]
		},



		{
			"id": 4,
			"title": "教师考评体系",
			"state": 0,
			"stateName": "未发布",
			"time": "2019-09-30",
			"questions": [
		
				{
					"type": "switch",
					"topic": "是否题",
					"group":"a",
					"options": ["我每月参加总部学术部组织的解题大赛，并力求获奖",
					"我每次备课都按总部“137”教学法要求执行",
					"我每次给同事评课都会按总部“137”教学法评定",
					"我每次备课都针对学生个性化特点认真备课，既注重学生智力因素，又注重学生非智力因素，以使教学效果最大化。",
					"我每次课后都会给学生写好“课后小结”，并针对学生特点每次课都会有亮点发现和表扬。每次都会将课后小结发送到家长群",
					"我每次给孩子上课都会在下课前对学生进行“过关放学”，以保证学生当堂课内容当堂课掌握。并将过关放学的内容在家长群展示。",
					"我每次课后都会按御书思学教育总部要求根据学生表现情况给孩子奖励小贴纸和小礼品，让学生爱上学习，认可老师",
					"我平时课后也会经常与学生进行思想沟通，鼓励学员，与孩子交朋友，争取获得孩子对老师的认可和尊重。",
					"每次课后我都会给孩子在微信群内做“延伸教学”或“打卡”活动，以求使孩子获得超值的教学和服务",
					"家长群内我积极回答家长和学生提出的任何问题，并保证每周在家长群活跃4-5次以上",
					"我每周会积极参与总部指定的校区教研活动，积极献计献策",
					"我认真学习御书思学教育ATP全域教研内容，没有学习运维手册充实自己",
					"总部统一安排的各类教研活动、比赛、征文等我都积极参加。",
					"我能讲解御书思学教育的“137”教学法",
					"我能讲解“优生学习生态圈”“学习动能毅模型”并付之于教学实践，领悟并发展这些理念。",
					"御书思学教育总部要求的“个性化卓越教师12大标准”我一直完善资料，并作为我个人的标准。",
					"我不断培养自己的营销意识，每月做好学员转介绍工作。",
					"我每天都会在校区群内活跃一次",
					"我每周按总部“微信服务截图展示日”要求将微信截图发送到校区群和总部群，争取获得表扬",
					"我每周参加校区组织的全员营销活动，培养自己营销意识和名师意识",
					"我每半年会按要求整理自己的个性化学员案例，争取在校区宣传栏展示",
					"我的微信朋友圈会按总部和校区要求进行微信营销，并经常展示学员和家长的优秀案例、授课状况等体现我个人及御书思学教育品牌",
					"我力求快速将自己打造成学生喜爱的名师，并争取在校区宣传栏及总部网站等地能宣传自己、主动推出自己",
					"我认真学习师训吾优，做到天天学习、天天提升、每天至少获得一个积分以上。",
					"总部学习群内容我都认真学习，并积极参与总部组织的各种教学教研分享",
					"总部和校区组织的所有培训我都认真参加，并于每次培训结束将培训笔记发送校区群分享",
					"总部和校区组织的会议都积极参与，充实自己",
					"我每月主动给所带学生进行月考试卷免费“SK试卷分析”，教学更有针对性，效果更好，同时获得学生和家长的认可",
					"认真参与学情交流会和家长会，精心准备",
					"我积极配合开展学员续费活动",
					"每次学生各类考试前我都会给孩子鼓励和动员，同时调整学员心态，调整客户预期",
					"我积极收集名校（本地名校和省会城市名校）月考、期中考、期末考试卷及中高考试卷，每次讲课都会渗透和补充一些考试内容，以使学员能在远程成为名校学生的同学，获取最优质的教学资源",
					"班组课第一次课我会选班干部，让学员协助老师自治管理，培养学员积极性好能力",
					"续费到来时，我会认真研究御书思学教育独特的“续费逻辑鱼骨图”，对照执行以获得最好的续费效果",
					"学期末家长会我会精心准备，公布来期及后阶段教学计划，并评选优秀学员、优秀干部和优秀家长。转发到所有朋友圈和群",
					"我每周会学习一个名师授课视频，提升自己授课水平和控堂能力",
					"我积极学习编写教材和教学资料，每年编写一本，提高自己所教授科目的知识体系化、模块化。并通过教材编撰装订成书以推销自己。",
					"我能积极配合咨询工作以获取新生，配合学管工作以做好服务和续费。"]
				}
			]
		},
		{
			"id": 5,
			"title": "学管考评体系",
			"state": 0,
			"stateName": "未发布",
			"time": "2019-09-30",
			"questions": [
		
				{
					"type": "switch",
					"topic": "是否题",
					"group":"a",
					"options": [
						"我给每个家庭建立微信群，并能做到每周在微信群活跃10次以上",
						"我督促教师每次课将“过关放学、延伸教学、课后小结”发送至家长微信群",
						"我是校区群活跃分子，不断将优秀学员实例、家长正向反馈，优秀老师授课细节（文字、图片、视频）等发送到校区群跟大家共享，并为微信营销提供素材",
						"我每天在校区群发送日报，期待大家对我的工作监督",
						"每次续费和转介绍我都会在校区群和学管群报单，获取大家的祝福，也激励所有同事。",
						"我每周会按总部要求将每一位教师微信服务的“课后小结、过关放学、延伸教学”等截图发送到校区群。并经常给大家点赞",
						"我认真学习御书思学教育总部《微信服务白皮书》，严格遵照执行，同时我能讲解微信白皮书内容，并给新员工培训。",
						"我对各年级孩子的特点、学习特点都很了解并能讲解学习策略",
						"我对学管师的话术掌握较好，能轻松与家长就孩子的各类问题交流解答",
						"我对本地和本省会城市小学、初中、高中名校很了解，对他们的招生政策、考试情况等都了解并录入了我的学管师工具包随时学习",
						"我对近3年小升初、中考、高考录取分数线非常了解，并能跟家长交流",
						"我能熟练使用御学云系统，并及时将课时录入系统，同时为学员签署纸质《课时单》，防止学员管理混乱，降低投资人管理风险",
						"我每天认真学习师训吾优体系，至少每天获得一个积分，提升自己能力，谋求未来晋升和发展空间",
						"总部所有的培训我都积极参加，并将每次培训学习的内容或心得发送到校区群",
						"总部学管师学习群里面更新的内容我都认真学习，并带到工作中。我也要学会分享。",
						"总部组织的所有学管应参加的会议我全部参加，并将会议内容发送到校区群供大家学习。",
						"我有专门的《家校联系表》，严格按总部要求与家长进行面对面交流、电话交流和微信交流。随时可以检查和抽查",
						"我带的学员“四会”全部按总部要求进行，并都有记录备查",
						"我给每个学员都按总部要求建有专门的档案，严格按要求完善管理资料和痕迹。整理规范、填写清晰、资料无遗漏",
						"我督促老师每次课后表扬学生并发送奖励贴纸和小礼品",
						"我督促老师严格按总部ATP全域教研开展教学教研工作、实施教学。",
						"我能按总部要求给一对一孩子召开学情交流会，同时给微班孩子召开学期初、学期中、学期末三个会议",
						"我给微班孩子选好班干部，实施班干部自治培养学员能力。期末我会协助老师一起评选优秀学员、优秀干部、优秀家长、微信达人等，并开好结业典礼",
						"我勤于学习续费技巧，每月学习一次《续费逻辑鱼骨图》内容，促进孩子续费，继续受益于总部统一管理带来的优质教学质量",
						"我按要求每周五提交给总部及主管《续费资源梳理表》，开好资源梳理会，拉动续费率",
						"我随时开展学员转介绍工作，积极探讨各种方法与家长沟通、与学员沟通、与老师沟通，共同推进转介绍任务达成。让更多孩子来御书思学学习。",
						"我每周会学习咨询师的《百问百答》，提升自己与家长沟通交流的能力，服务好家长和学员，与家长和学员交朋友，让学员热爱学习，促进提分效果",
						"我每周会对御书思学教育总部的《学管运维手册》认真学习一次，提升自己的能力。",
						"我每学期收集整理优秀学员案例，并维护好校区《学生园地》",
						"我在每次期中考、期末考、中考、高考结束后及时整理优秀学员情况，并协助市场部做好喜报。",
						"我每月督促孩子带月考试卷来学校，让授课老师免费为孩子进行“SK试卷分析”，以确保教学的针对性、及时调整教学计划，让提分效果更明显",
						"我每天坚持发朋友圈，向学生家长展示我的优质服务",
						"我对每个孩子都很有耐心"
						]
				}
			]
		},
		{
			"id": 6,
			"title": "咨询考评体系",
			"state": 0,
			"stateName": "未发布",
			"time": "2019-09-30",
			"questions": [
		
				{
					"type": "switch",
					"topic": "是否题",
					"group":"a",
					"options": [
						"平时加强自己签单客户的交流，促进转介绍的突破",
						"对不同年级的学生特点、学习特点能充分解说",
						"对本地小升初、中考政策及高考政策、招生录取情况等了如指掌能随时跟家长解读并装订成册及时更新",
						"对本地及本省重点小学、重点初中、重点高中招录政策、重点班招录政策条件等了如指掌并装订成册及时更新",
						"经常使用御书思学教育CPS测评体系，加强面咨的专业度",
						"每周进行一次咨询道具学习并更新充实",
						"每月督促学校做好月度广告投放，扩大品牌影响力，以降低咨询陌拜邀约难度。",
						"每月督促市场部做好营销物料更新、名校试卷收集，咨询陌拜、邀约、面咨等充分使用和利用这些物料加强成功率",
						"我清楚地认识我的任务就是提升能力签单出业绩，让越来越多的孩子受益于御书思学优质教育培训。",
						"我能将御书思学教育ATP全域统一教研的特色非常透彻地跟家长讲解并实物展示给家长。",
						"校区的每个软装我都能跟家长讲解",
						"每次面咨前，我都对每个客户能详细备单，并提前确定针对性面咨预案",
						"我能清楚地讲解御书思学教育TDM垂直管理中全国统一直管的10大特色以及每个特色带给客户的优势和好处。",
						"我能展示御书思学教育TDM垂直管理中全国直管的10大可视化资料给客户，能让客户明显感受到我们总部统一管理（特别是教研、教师水平、教学质量和服务）带来所有遥遥领先于同行的教育品质。"
						]
				}
			]
		}




		








		
		

	];


var template = {
			radio: {
					"type": "radio",
					"topic": "单选题",
					"options": ["选项1","选项2","选项3","选项4"]
				},
			checkbox: {
					"type": "checkbox",
					"topic": "多选题",
					"options": ["选项1","选项2","选项3","选项4"]
				},
			textarea: {
					"type": "textarea",
					"topic": "文本题",
					"isMandatory": false
				}
		};

var date = function(year, month) {
	// 若未传入参数或参数不完整 即获取当月的数据
	if (year === undefined || month === undefined) {
		let today = new Date();
		year = today.getFullYear();
		month = today.getMonth();
	}

	// 获取该月第一天和该天是礼拜几
	var firstDay = new Date(year, month, 1);
	var firstDayWeekday = firstDay.getDay() || 7;

	// 获取该月最后一天日期和该天是礼拜几
	var lastDay = new Date(year, month+1, 0);
	var lastDate = lastDay.getDate();


	// 获取上个月需显示天数和上月最后一天日期
	var lastDayOfPrevMonth = new Date(year, month, 0);
	var lastDateOfPrevMonth = lastDayOfPrevMonth.getDate();
	var prevMonthDayCount = firstDayWeekday - 1; 	 // 日历起始日为星期一
	// var prevMonthDayCount = firstDayWeekday; // 日历起始日为星期日

	var count = 0;
	var dayArr = [];
	var weekArr = [];

	for (let j = 0; j < 6; j++) {
		for (let i = 0;  i < 7; i++) {
			count++;
			let showDate,
			 	showMonth,
			  	date = count - prevMonthDayCount;

			if (date <= 0) {
				// 上个月
				showDate = lastDateOfPrevMonth + date;
				showMonth = month;
			}
			else if (date > lastDate) {
				// 下个月
				showDate = date - lastDate;
				showMonth = month + 2;
			}
			else {
				showDate = date;
				showMonth = month + 1;
			}

			if (showMonth >= 13) showMonth = 1;
			if (showMonth <= 0) showMonth = 12;

			dayArr.push({
				date: date,
				month: showMonth,
				showDate: showDate
			});
		}
		weekArr.push(dayArr.slice());
		dayArr.length = 0;
	}

	// 重新获取当前年月 以确保数据准确
	year = firstDay.getFullYear();
	month = firstDay.getMonth() + 1;

	// 此处的 flag 是用来判断最后一周是不是全部属于下个月 是则移除最后一周
	var flag = weekArr[5].every( item => item.month !== month);
	if (flag) {
		weekArr.pop();
	}

	return {
		year: year,
		month: month,
		weeks: weekArr
	};
};


export default {
	list,
	date,
	template
}

